package Test;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class T1 {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		//String s = "(শনিবার|রবিবার|রোববার|সোমবার|মঙ্গলবার|বুধবার|বৃহস্পতিবার|শুক্রবার)|(([০-৯]|০[১-৯]|[১২][০-৯]|৩[০১])(লা |রা |ঠা |ই |শে |[- /.])([০-৯]|০[১-৯]|১[০-২]|জানুয়ারি|ফেব্রুয়ারি|মার্চ|এপ্রিল|মে|জুন|জুলাই|আগস্ট|সেপ্টেম্বর|অ|ক্টোবর|নভেম্বরডিসেম্বর)[- /.]([০-৯][০-৯][০-৯][০-৯]|[০-৯][০-৯])?)";
		//String input = "মঙ্গলবার__১৫-০২-২০১৮__১৫/০২/২০১৮__১৫.০২.২০১৮__১৫ ০২ ২০১৮__১৫ ফেব্রুয়ারি ২০১৮__১-১-১৮__১লা ফেব্রুয়ারি ২০১৮__৩রা ফেব্রুয়ারি ২০১৮__৪ঠা ফেব্রুয়ারি ২০১৮__৭ই ফেব্রুয়ারি ২০১৮__২১শে ফেব্রুয়ারি ২০১৮__৩ ফেব্রুয়ারি __বৃহস্পতিবার__রোববার";
		//String s = "([0-9]|0[1-9]|[12][0-9]|3[01])[- /.]([0-9]|0[1-9]|1[0-2])[- /.]([0-9][0-9][0-9][0-9]|[0-9][0-9])";
		//String input = "15-02-2018__15.02.2018__15/02/20";
		//String s = "(([০-৯]+)([.]([০-৯]+))?)|([.]([০-৯]+))";
		//String input = "৫০০.৫৭ টাকা দিয়ে ৫ খানা বল কিনলাম।প্রতিবলের মূল্য ০.৬৭ পয়সা";
		//String s = "(\"([^\"])*(\")?)|(\'([^\'])*(\')?)|(‘([^’])*(’)?)";
		//String input = "ওমর লুলুর ‘অরু আদার লাভ";
		String s = "((http|ftp|https)://([\\w_-]+(?:(?:\\.[\\w_-]+)+))([\\w.,@?^=%&:/~+#-]*[\\w@?^=%&/~+#-])?)|(\\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}\\b)";
		String input = "http://google.com NUrg nur.quraishi@gmail.com hsdh https://stackoverflow.com";
		
		Pattern pattern = Pattern.compile(s);
		Matcher matcher = pattern.matcher(input);
		String output = "";
		while(matcher.find())
		{
			output += matcher.group() + "\n";
		}
		System.out.println(output);
	}

}
